nested-routes-going-camping/app/controllers/campsites_controller.rb

  def index
    @title = "All Campsites:"
    @campsites = Campsite.all
---
SELECT "campsites".* FROM "campsites"

  def show
    @campsite = Campsite.find(params[:campsite_id])
---
SELECT  "campsites".* FROM "campsites" WHERE "campsites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]