nested-routes-going-camping/app/controllers/campers_controller.rb

SELECT "campers".* FROM "campers"
---
  def index
    @title = "All Campers:"
    @campers = Camper.all