nested-routes-going-camping/app/controllers/supplies_controller.rb

SELECT "supplies".* FROM "supplies"
---
  def index
    @title = "All Supplies:"
    @supplies = Supply.all